chore: docs updates
